# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [16]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [17]:
s1 = pd.Series(np.random.randint(1, 5, 100))
s2 = pd.Series(np.random.randint(1, 4, 100))
s3 = pd.Series(np.random.randint(10000, 30001, 100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [18]:
df = pd.concat([s1, s2, s3], axis=1)
df

    0  1      2
0   3  2  16192
1   3  1  12774
2   3  1  26655
3   1  2  26129
4   2  3  14468
.. .. ..    ...
95  2  1  19548
96  1  3  25925
97  1  1  12904
98  4  2  16482
99  1  2  21265

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [19]:
df.rename(columns={0: 'bedrs', 1: 'bathrs', 2: 'price_sqr_meter'}, inplace=True)
df

    bedrs  bathrs  price_sqr_meter
0       3       2            16192
1       3       1            12774
2       3       1            26655
3       1       2            26129
4       2       3            14468
..    ...     ...              ...
95      2       1            19548
96      1       3            25925
97      1       1            12904
98      4       2            16482
99      1       2            21265

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [20]:
bigcolumn = pd.concat([s1, s2, s3], axis=0)
bigcolumn

0         3
1         3
2         3
3         1
4         2
      ...
95    19548
96    25925
97    12904
98    16482
99    21265
Length: 300, dtype: int64

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [21]:
"Wrong"

'Wrong'

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [22]:
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn

0          3
1          3
2          3
3          1
4          2
       ...
295    19548
296    25925
297    12904
298    16482
299    21265
Length: 300, dtype: int64